// Написать программу которая на вход принимает число и выдает ее квадрат
Console.WriteLine ("Введи число ");
int number=int.Parse(Console.ReadLine());

// Квадрат математически
int sqr=number*number;

Console.WriteLine ($"Кварат {number} равен {sqr}");